CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32A74x.xml
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<OPBytesBlocks>
	<OPBytesBlock baseAddress="0x1FFF8800" length="54"/>
	<OPBytesBlock baseAddress="0x1FFFF880" length="8"/>
</OPBytesBlocks>
<OPBytes baseAddress="0x1FFF8800" length="54">
	<OPByte>
		<name>OB_SPC</name>
		<displayName>OB_SPC</displayName>
		<addressOffset>0x0</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xA5</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_SPC</name>
				<brief>HOST option bytes security protection value</brief>
				<description>HOST option bytes security protection value&#x000A;0xA5 : no security protection&#x000A;any value except 0xA5 or 0xCC : protection level low&#x000A;0xCC : protection level high</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_SPC_N</name>
		<displayName>OB_SPC_N</displayName>
		<addressOffset>0x1</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x5A</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_SPC_N</name>
				<brief>OB_SPC complement value</brief>
				<description>OB_SPC complement value</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER</name>
		<displayName>OB_USER</displayName>
		<addressOffset>0x2</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>nWDG_DPSLP</name>
				<brief>nWDG_DPSLP</brief>
				<description>nWDG_DPSLP&#x000A;0: free watchdog 0 / 1 stop counting in deep-sleep mode&#x000A;1: free watchdog 0 / 1 continue counting in deep-sleep mode</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nWDG_STDBY</name>
				<brief>nWDG_STDBY</brief>
				<description>nWDG_STDBY&#x000A;0: free watchdog 0 / 1 stop counting in standby mode&#x000A;1: free watchdog 0 / 1 continue counting in standby mode</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nWDG1_HW</name>
				<brief>nWDG1_HW</brief>
				<description>nWDG1_HW&#x000A;0: hardware free watchdog 1&#x000A;1: software free watchdog 1</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nRST_STDBY</name>
				<brief>nRST_STDBY</brief>
				<description>nRST_STDBY&#x000A;0: generate a reset instead of entering standby mode&#x000A;1: no reset when entering standby mode</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nRST_DPSLP</name>
				<brief>nRST_DPSLP</brief>
				<description>nRST_DPSLP&#x000A;0: generate a reset instead of entering deep-sleep mode&#x000A;1: no reset when entering deep-sleep mode</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>nWDG0_HW</name>
				<brief>nWDG0_HW</brief>
				<description>nWDG0_HW&#x000A;0: hardware free watchdog 0&#x000A;1: software free watchdog 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER_N</name>
		<displayName>OB_USER_N</displayName>
		<addressOffset>0x3</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER_N</name>
				<brief>OB_USER complement value</brief>
				<description>OB_USER complement value</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DATA[7:0]</name>
		<displayName>OB_DATA[7:0]</displayName>
		<addressOffset>0x4</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_DATA[7:0]</name>
				<brief>user defined data bit 7 to 0</brief>
				<description>user defined data bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DATA_N[7:0]</name>
		<displayName>OB_DATA_N[7:0]</displayName>
		<addressOffset>0x5</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_DATA_N[7:0]</name>
				<brief>OB_DATA complement value bit 7 to 0</brief>
				<description>OB_DATA complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DATA[15:8]</name>
		<displayName>OB_DATA[15:8]</displayName>
		<addressOffset>0x6</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_DATA[15:8]</name>
				<brief>user defined data bit 15 to 8</brief>
				<description>user defined data bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DATA_N[15:8]</name>
		<displayName>OB_DATA_N[15:8]</displayName>
		<addressOffset>0x7</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_DATA_N[15:8]</name>
				<brief>OB_DATA complement value bit 15 to 8</brief>
				<description>OB_DATA complement value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP[7:0]</name>
		<displayName>OB_BK0WP[7:0]</displayName>
		<addressOffset>0x8</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK0WP[7]</name>
				<brief>0x08070000~0x0807FFFF</brief>
				<description>Page erase / program protection of bank0 bit 7(0x08070000~0x0807FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[6]</name>
				<brief>0x08060000~0x0806FFFF</brief>
				<description>Page erase / program protection of bank0 bit 6(0x08060000~0x0806FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[5]</name>
				<brief>0x08050000~0x0805FFFF</brief>
				<description>Page erase / program protection of bank0 bit 5(0x08050000~0x0805FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[4]</name>
				<brief>0x08040000~0x0804FFFF</brief>
				<description>Page erase / program protection of bank0 bit 4(0x08040000~0x0804FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[3]</name>
				<brief>0x08030000~0x0803FFFF</brief>
				<description>Page erase / program protection of bank0 bit 3(0x08030000~0x0803FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[2]</name>
				<brief>0x08020000~0x0802FFFF</brief>
				<description>Page erase / program protection of bank0 bit 2(0x08020000~0x0802FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[1]</name>
				<brief>0x08010000~0x0801FFFF</brief>
				<description>Page erase / program protection of bank0 bit 1(0x08010000~0x0801FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[0]</name>
				<brief>0x08000000~0x0800FFFF</brief>
				<description>Page erase / program protection of bank0 bit 0(0x08000000~0x0800FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP_N[7:0]</name>
		<displayName>OB_BK0WP_N[7:0]</displayName>
		<addressOffset>0x9</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK0WP_N[7:0]</name>
				<brief>OB_BK0WP complement value bit 7 to 0</brief>
				<description>OB_BK0WP complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP[15:8]</name>
		<displayName>OB_BK0WP[15:8]</displayName>
		<addressOffset>0xA</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK0WP[15]</name>
				<brief>0x080F0000~0x080FFFFF</brief>
				<description>Page erase / program protection of bank0 bit 15(0x080F0000~0x080FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[14]</name>
				<brief>0x080E0000~0x080EFFFF</brief>
				<description>Page erase / program protection of bank0 bit 14(0x080E0000~0x080EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[13]</name>
				<brief>0x080D0000~0x080DFFFF</brief>
				<description>Page erase / program protection of bank0 bit 13(0x080D0000~0x080DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[12]</name>
				<brief>0x080C0000~0x080CFFFF</brief>
				<description>Page erase / program protection of bank0 bit 12(0x080C0000~0x080CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[11]</name>
				<brief>0x080B0000~0x080BFFFF</brief>
				<description>Page erase / program protection of bank0 bit 11(0x080B0000~0x080BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[10]</name>
				<brief>0x080A0000~0x080AFFFF</brief>
				<description>Page erase / program protection of bank0 bit 10(0x080A0000~0x080AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[9]</name>
				<brief>0x08090000~0x0809FFFF</brief>
				<description>Page erase / program protection of bank0 bit 9(0x08090000~0x0809FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[8]</name>
				<brief>0x08080000~0x0808FFFF</brief>
				<description>Page erase / program protection of bank0 bit 8(0x08080000~0x0808FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP_N[15:8]</name>
		<displayName>OB_BK0WP_N[15:8]</displayName>
		<addressOffset>0xB</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK0WP_N[15:8]</name>
				<brief>OB_BK0WP complement value bit 15 to 8</brief>
				<description>OB_BK0WP complement value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP[23:16]</name>
		<displayName>OB_BK0WP[23:16]</displayName>
		<addressOffset>0xC</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK0WP[23]</name>
				<brief>0x08170000~0x0817FFFF</brief>
				<description>Page erase / program protection of bank0 bit 23(0x08170000~0x0817FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[22]</name>
				<brief>0x08160000~0x0816FFFF</brief>
				<description>Page erase / program protection of bank0 bit 22(0x08160000~0x0816FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[21]</name>
				<brief>0x08150000~0x0815FFFF</brief>
				<description>Page erase / program protection of bank0 bit 21(0x08150000~0x0815FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[20]</name>
				<brief>0x08140000~0x0814FFFF</brief>
				<description>Page erase / program protection of bank0 bit 20(0x08140000~0x0814FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[19]</name>
				<brief>0x08130000~0x0813FFFF</brief>
				<description>Page erase / program protection of bank0 bit 19(0x08130000~0x0813FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[18]</name>
				<brief>0x08120000~0x0812FFFF</brief>
				<description>Page erase / program protection of bank0 bit 18(0x08120000~0x0812FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[17]</name>
				<brief>0x08110000~0x0811FFFF</brief>
				<description>Page erase / program protection of bank0 bit 17(0x08110000~0x0811FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[16]</name>
				<brief>0x08100000~0x0810FFFF</brief>
				<description>Page erase / program protection of bank0 bit 16(0x08100000~0x0810FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP_N[23:16]</name>
		<displayName>OB_BK0WP_N[23:16]</displayName>
		<addressOffset>0xD</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK0WP_N[23:16]</name>
				<brief>OB_BK0WP complement value bit 23 to 16</brief>
				<description>OB_BK0WP complement value bit 23 to 16</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP[31:24]</name>
		<displayName>OB_BK0WP[31:24]</displayName>
		<addressOffset>0xE</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK0WP[31]</name>
				<brief>0x081F0000~0x081FFFFF</brief>
				<description>Page erase / program protection of bank0 bit 31(0x081F0000~0x081FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[30]</name>
				<brief>0x081E0000~0x081EFFFF</brief>
				<description>Page erase / program protection of bank0 bit 30(0x081E0000~0x081EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[29]</name>
				<brief>0x081D0000~0x081DFFFF</brief>
				<description>Page erase / program protection of bank0 bit 29(0x081D0000~0x081DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[28]</name>
				<brief>0x081C0000~0x081CFFFF</brief>
				<description>Page erase / program protection of bank0 bit 28(0x081C0000~0x081CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[27]</name>
				<brief>0x081B0000~0x081BFFFF</brief>
				<description>Page erase / program protection of bank0 bit 27(0x081B0000~0x081BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[26]</name>
				<brief>0x081A0000~0x081AFFFF</brief>
				<description>Page erase / program protection of bank0 bit 26(0x081A0000~0x081AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[25]</name>
				<brief>0x08190000~0x0819FFFF</brief>
				<description>Page erase / program protection of bank0 bit 25(0x08190000~0x0819FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK0WP[24]</name>
				<brief>0x08180000~0x0818FFFF</brief>
				<description>Page erase / program protection of bank0 bit 24(0x08180000~0x0818FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK0WP_N[31:24]</name>
		<displayName>OB_BK0WP_N[31:24]</displayName>
		<addressOffset>0xF</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK0WP_N[31:24]</name>
				<brief>OB_BK0WP complement value bit 31 to 24</brief>
				<description>OB_BK0WP complement value bit 31 to 24</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP[7:0]</name>
		<displayName>OB_BK1WP[7:0]</displayName>
		<addressOffset>0x10</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK1WP[7]</name>
				<brief>0x08270000~0x0827FFFF</brief>
				<description>Page erase / program protection of bank1 bit 7(0x08270000~0x0827FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[6]</name>
				<brief>0x08260000~0x0826FFFF</brief>
				<description>Page erase / program protection of bank1 bit 6(0x08260000~0x0826FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[5]</name>
				<brief>0x08250000~0x0825FFFF</brief>
				<description>Page erase / program protection of bank1 bit 5(0x08250000~0x0825FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[4]</name>
				<brief>0x08240000~0x0824FFFF</brief>
				<description>Page erase / program protection of bank1 bit 4(0x08240000~0x0824FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[3]</name>
				<brief>0x08230000~0x0823FFFF</brief>
				<description>Page erase / program protection of bank1 bit 3(0x08230000~0x0823FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[2]</name>
				<brief>0x08220000~0x0822FFFF</brief>
				<description>Page erase / program protection of bank1 bit 2(0x08220000~0x0822FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[1]</name>
				<brief>0x08210000~0x0821FFFF</brief>
				<description>Page erase / program protection of bank1 bit 1(0x08210000~0x0821FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[0]</name>
				<brief>0x08200000~0x0820FFFF</brief>
				<description>Page erase / program protection of bank1 bit 0(0x08200000~0x0820FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP_N[7:0]</name>
		<displayName>OB_BK1WP_N[7:0]</displayName>
		<addressOffset>0x11</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK1WP_N[7:0]</name>
				<brief>OB_BK1WP complement value bit 7 to 0</brief>
				<description>OB_BK1WP complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP[15:8]</name>
		<displayName>OB_BK1WP[15:8]</displayName>
		<addressOffset>0x12</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK1WP[15]</name>
				<brief>0x082F0000~0x082FFFFF</brief>
				<description>Page erase / program protection of bank1 bit 15(0x082F0000~0x082FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[14]</name>
				<brief>0x082E0000~0x082EFFFF</brief>
				<description>Page erase / program protection of bank1 bit 14(0x082E0000~0x082EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[13]</name>
				<brief>0x082D0000~0x082DFFFF</brief>
				<description>Page erase / program protection of bank1 bit 13(0x082D0000~0x082DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[12]</name>
				<brief>0x082C0000~0x082CFFFF</brief>
				<description>Page erase / program protection of bank1 bit 12(0x082C0000~0x082CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[11]</name>
				<brief>0x082B0000~0x082BFFFF</brief>
				<description>Page erase / program protection of bank1 bit 11(0x082B0000~0x082BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[10]</name>
				<brief>0x082A0000~0x082AFFFF</brief>
				<description>Page erase / program protection of bank1 bit 10(0x082A0000~0x082AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[9]</name>
				<brief>0x08290000~0x0829FFFF</brief>
				<description>Page erase / program protection of bank1 bit 9(0x08290000~0x0829FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[8]</name>
				<brief>0x08280000~0x0828FFFF</brief>
				<description>Page erase / program protection of bank1 bit 8(0x08280000~0x0828FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
