CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32A74x.xml
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP_N[15:8]</name>
		<displayName>OB_BK1WP_N[15:8]</displayName>
		<addressOffset>0x13</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK1WP_N[15:8]</name>
				<brief>OB_BK1WP complement value bit 15 to 8</brief>
				<description>OB_BK1WP complement value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP[23:16]</name>
		<displayName>OB_BK1WP[23:16]</displayName>
		<addressOffset>0x14</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK1WP[23]</name>
				<brief>0x08370000~0x0837FFFF</brief>
				<description>Page erase / program protection of bank1 bit 23(0x08370000~0x0837FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[22]</name>
				<brief>0x08360000~0x0836FFFF</brief>
				<description>Page erase / program protection of bank1 bit 22(0x08360000~0x0836FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[21]</name>
				<brief>0x08350000~0x0835FFFF</brief>
				<description>Page erase / program protection of bank1 bit 21(0x08350000~0x0835FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[20]</name>
				<brief>0x08340000~0x0834FFFF</brief>
				<description>Page erase / program protection of bank1 bit 20(0x08340000~0x0834FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[19]</name>
				<brief>0x08330000~0x0833FFFF</brief>
				<description>Page erase / program protection of bank1 bit 19(0x08330000~0x0833FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[18]</name>
				<brief>0x08320000~0x0832FFFF</brief>
				<description>Page erase / program protection of bank1 bit 18(0x08320000~0x0832FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[17]</name>
				<brief>0x08310000~0x0831FFFF</brief>
				<description>Page erase / program protection of bank1 bit 17(0x08310000~0x0831FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[16]</name>
				<brief>0x08300000~0x0830FFFF</brief>
				<description>Page erase / program protection of bank1 bit 16(0x08300000~0x0830FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP_N[23:16]</name>
		<displayName>OB_BK1WP_N[23:16]</displayName>
		<addressOffset>0x15</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK1WP_N[23:16]</name>
				<brief>OB_BK1WP complement value bit 23 to 16</brief>
				<description>OB_BK1WP complement value bit 23 to 16</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP[31:24]</name>
		<displayName>OB_BK1WP[31:24]</displayName>
		<addressOffset>0x16</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_BK1WP[31]</name>
				<brief>0x083F0000~0x083FFFFF</brief>
				<description>Page erase / program protection of bank1 bit 31(0x083F0000~0x083FFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[30]</name>
				<brief>0x083E0000~0x083EFFFF</brief>
				<description>Page erase / program protection of bank1 bit 30(0x083E0000~0x083EFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[29]</name>
				<brief>0x083D0000~0x083DFFFF</brief>
				<description>Page erase / program protection of bank1 bit 29(0x083D0000~0x083DFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[28]</name>
				<brief>0x083C0000~0x083CFFFF</brief>
				<description>Page erase / program protection of bank1 bit 28(0x083C0000~0x083CFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[27]</name>
				<brief>0x083B0000~0x083BFFFF</brief>
				<description>Page erase / program protection of bank1 bit 27(0x083B0000~0x083BFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[26]</name>
				<brief>0x083A0000~0x083AFFFF</brief>
				<description>Page erase / program protection of bank1 bit 26(0x083A0000~0x083AFFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[25]</name>
				<brief>0x08390000~0x0839FFFF</brief>
				<description>Page erase / program protection of bank1 bit 25(0x08390000~0x0839FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_BK1WP[24]</name>
				<brief>0x08380000~0x0838FFFF</brief>
				<description>Page erase / program protection of bank1 bit 24(0x08380000~0x0838FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_BK1WP_N[31:24]</name>
		<displayName>OB_BK1WP_N[31:24]</displayName>
		<addressOffset>0x17</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_BK1WP_N[31:24]</name>
				<brief>OB_BK1WP complement value bit 31 to 24</brief>
				<description>OB_BK1WP complement value bit 31 to 24</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[7:0]</name>
		<displayName>OB_USER1[7:0]</displayName>
		<addressOffset>0x18</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>value bit 7 to 0</name>
				<brief>value bit 7 to 0</brief>
				<description>value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[7:0]</name>
		<displayName>OB_USER1_N[7:0]</displayName>
		<addressOffset>0x19</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[7:0]</name>
				<brief>OB_USER1 complement value bit 7 to 0</brief>
				<description>OB_USER1 complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[15:8]</name>
		<displayName>OB_USER1[15:8]</displayName>
		<addressOffset>0x1A</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[15:8]</name>
				<brief>OB_USER1 value bit 15 to 8</brief>
				<description>OB_USER1 value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[15:8]</name>
		<displayName>OB_USER1_N[15:8]</displayName>
		<addressOffset>0x1B</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[15:8]</name>
				<brief>OB_USER1 complement value bit 15 to 8</brief>
				<description>OB_USER1 complement value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[23:16]</name>
		<displayName>OB_USER1[23:16]</displayName>
		<addressOffset>0x1C</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[23:16]</name>
				<brief>OB_USER1 value bit 23 to 16</brief>
				<description>OB_USER1 value bit 23 to 16</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[23:16]</name>
		<displayName>OB_USER1_N[23:16]</displayName>
		<addressOffset>0x1D</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[23:16]</name>
				<brief>OB_USER1 complement value bit 23 to 16</brief>
				<description>OB_USER1 complement value bit 23 to 16</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[31:24]</name>
		<displayName>OB_USER1[31:24]</displayName>
		<addressOffset>0x1E</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[31:24]</name>
				<brief>OB_USER1 value bit 31 to 24</brief>
				<description>OB_USER1 value bit 31 to 24</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[31:24]</name>
		<displayName>OB_USER1_N[31:24]</displayName>
		<addressOffset>0x1F</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[31:24]</name>
				<brief>OB_USER1 complement value bit 31 to 24</brief>
				<description>OB_USER1 complement value bit 31 to 24</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[39:32]</name>
		<displayName>OB_USER1[39:32]</displayName>
		<addressOffset>0x20</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[39:32]</name>
				<brief>OB_USER1 value bit 39 to 32</brief>
				<description>OB_USER1 value bit 39 to 32</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[39:32]</name>
		<displayName>OB_USER1_N[39:32]</displayName>
		<addressOffset>0x21</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[39:32]</name>
				<brief>OB_USER1 complement value bit 39 to 32</brief>
				<description>OB_USER1 complement value bit 39 to 32</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[47:40]</name>
		<displayName>OB_USER1[47:40]</displayName>
		<addressOffset>0x22</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[47:40]</name>
				<brief>OB_USER1 value bit 47 to 40</brief>
				<description>OB_USER1 value bit 47 to 40</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[47:40]</name>
		<displayName>OB_USER1_N[47:40]</displayName>
		<addressOffset>0x23</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[47:40]</name>
				<brief>OB_USER1 complement value bit 47 to 40</brief>
				<description>OB_USER1 complement value bit 47 to 40</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[55:48]</name>
		<displayName>OB_USER1[55:48]</displayName>
		<addressOffset>0x24</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[55:48]</name>
				<brief>OB_USER1 value bit 55 to 48</brief>
				<description>OB_USER1 value bit 55 to 48</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[55:48]</name>
		<displayName>OB_USER1_N[55:48]</displayName>
		<addressOffset>0x25</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[55:48]</name>
				<brief>OB_USER1 complement value bit 55 to 48</brief>
				<description>OB_USER1 complement value bit 55 to 48</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1[63:56]</name>
		<displayName>OB_USER1[63:56]</displayName>
		<addressOffset>0x26</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_USER1[63:56]</name>
				<brief>OB_USER1 value bit 63 to 56</brief>
				<description>OB_USER1 value bit 63 to 56</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_USER1_N[63:56]</name>
		<displayName>OB_USER1_N[63:56]</displayName>
		<addressOffset>0x27</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_USER1_N[63:56]</name>
				<brief>OB_USER1 complement value bit 63 to 56</brief>
				<description>OB_USER1 complement value bit 63 to 56</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DFWP[7:0]</name>
		<displayName>OB_DFWP[7:0]</displayName>
		<addressOffset>0x28</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_DFWP[7]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 7(0x0881C000~0x0881FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[6]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 6(0x08818000~0x0881BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>6</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[5]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 5(0x08814000~0x08817FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>5</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[4]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 4(0x08810000~0x08813FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>4</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[3]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 3(0x0880C000~0x0880FFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>3</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[2]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 2(0x08808000~0x0880BFFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>2</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[1]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 1(0x08804000~0x08807FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>OB_DFWP[0]</name>
				<brief></brief>
				<description>Page erase / program protection of Data flash bit 0(0x08800000~0x08803FFF)&#x000A;0: protection active&#x000A;1: unprotected</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_DFWP_N[7:0]</name>
		<displayName>OB_DFWP_N[7:0]</displayName>
		<addressOffset>0x29</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_DFWP_N[7:0]</name>
				<brief>OB_DFWP complement value bit 7 to 0</brief>
				<description>OB_DFWP complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[7:0]</name>
		<displayName>OB_CLTCFG[7:0]</displayName>
		<addressOffset>0x2A</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0xFF</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>PORWDG_EN, refer to bit0 of the Subsystem Reset Configuration Load Register 0</name>
				<brief>PORWDG_EN, refer to bit0 of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0)</brief>
				<description>PORWDG_EN, refer to bit0 of the Subsystem Reset Configuration Load Register 0</description>
				<bitOffset>7</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>FFPIN_MOD, refer to bit31 of the System Reset Configuration Load Register 1</name>
				<brief>FFPIN_MOD, refer to bit31 of the System Reset Configuration Load Register 1 (CLTCFG_SR_CFGLD1)</brief>
				<description>FFPIN_MOD, refer to bit31 of the System Reset Configuration Load Register 1</description>
				<bitOffset>1</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
			<field>
				<name>RSTPIN_MOD, refer to bit0 of the System Reset Configuration Load Register 0</name>
				<brief>RSTPIN_MOD, refer to bit0 of the System Reset Configuration Load Register 0 (CLTCFG_SR_CFGLD0)</brief>
				<description>RSTPIN_MOD, refer to bit0 of the System Reset Configuration Load Register 0 (CLTCFG_SR_CFGLD0)</description>
				<bitOffset>0</bitOffset>
				<bitWidth>1</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[7:0]</name>
		<displayName>OB_CLTCFG_N[7:0]</displayName>
		<addressOffset>0x2B</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0x00</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[7:0]</name>
				<brief>OB_CLTCFG complement value bit 7 to 0</brief>
				<description>OB_CLTCFG complement value bit 7 to 0</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[15:8]</name>
		<displayName>OB_CLTCFG[15:8]</displayName>
		<addressOffset>0x2C</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0x00</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SYSRST_ES[7:0], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0</name>
				<brief>SYSRST_ES[7:0], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</brief>
				<description>SYSRST_ES[7:0], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[15:8]</name>
		<displayName>OB_CLTCFG_N[15:8]</displayName>
		<addressOffset>0x2D</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0xFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[15:8]</name>
				<brief>OB_CLTCFG complement value bit 15 to 8</brief>
				<description>OB_CLTCFG complement value bit 15 to 8</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[23:16]</name>
		<displayName>OB_CLTCFG[23:16]</displayName>
		<addressOffset>0x2E</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0x00</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SYSRST_ES[15:8], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0</name>
				<brief>SYSRST_ES[15:8], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</brief>
				<description>SYSRST_ES[15:8], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</description>
				<bitOffset>16</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[23:16]</name>
		<displayName>OB_CLTCFG_N[23:16]</displayName>
		<addressOffset>0x2F</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0xFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[23:16]</name>
				<brief>OB_CLTCFG complement value bit 23 to 16</brief>
				<description>OB_CLTCFG complement value bit 23 to 16</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[31:24]</name>
		<displayName>OB_CLTCFG[31:24]</displayName>
		<addressOffset>0x30</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0x00</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SYSRST_ES[23:16], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0</name>
				<brief>SYSRST_ES[23:16], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</brief>
				<description>SYSRST_ES[23:16], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</description>
				<bitOffset>24</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[31:24]</name>
		<displayName>OB_CLTCFG_N[31:24]</displayName>
		<addressOffset>0x31</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0xFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[31:24]</name>
				<brief>OB_CLTCFG complement value bit 31 to 24</brief>
				<description>OB_CLTCFG complement value bit 31 to 24</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[39:32]</name>
		<displayName>OB_CLTCFG[39:32]</displayName>
		<addressOffset>0x32</addressOffset>
