CommunityGD32Cores/pio-gd32-gdlinkcli/OptionBytesXML/GD32A74x.xml
		<size>0x8</size>
		<access>read-write</access>
		<reset>0x00</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>SYSRST_ES[31:24], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0</name>
				<brief>SYSRST_ES[31:24], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</brief>
				<description>SYSRST_ES[31:24], refer to bits[31:18] of the Subsystem Reset Configuration Load Register 0 (CLTCFG_SUBSR_CFGLD0) and bits[17:0] of the Subsystem Reset Configuration Load Register 1 (CLTCFG_SUBSR_CFGLD1)</description>
				<bitOffset>32</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[39:32]</name>
		<displayName>OB_CLTCFG_N[39:32]</displayName>
		<addressOffset>0x33</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0xFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[39:32]</name>
				<brief>OB_CLTCFG complement value bit 39 to 32</brief>
				<description>OB_CLTCFG complement value bit 39 to 32</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG[47:40]</name>
		<displayName>OB_CLTCFG[47:40]</displayName>
		<addressOffset>0x34</addressOffset>
		<size>0x8</size>
		<access>read-write</access>
		<reset>0x00</reset>
		<complement>FFFF</complement>
		<fields>
			<field>
				<name>OB_CLTCFG[47:40]</name>
				<brief>Refer to CLTCFG</brief>
				<description>Refer to CLTCFG</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
	<OPByte>
		<name>OB_CLTCFG_N[47:40]</name>
		<displayName>OB_CLTCFG_N[47:40]</displayName>
		<addressOffset>0x35</addressOffset>
		<size>0x8</size>
		<access>read</access>
		<reset>0xFF</reset>
		<complement>0</complement>
		<fields>
			<field>
				<name>OB_CLTCFG_N[47:40]</name>
				<brief>OB_CLTCFG complement value bit 47 to 40</brief>
				<description>OB_CLTCFG complement value bit 47 to 40</description>
				<bitOffset>0</bitOffset>
				<bitWidth>8</bitWidth>
			</field>
		</fields>
	</OPByte>
</OPBytes>
<OPBytes baseAddress="0x1FFFF880" length="8">
        <OPByte>
            <name>OB_HSMUSER[7:0]</name>
            <displayName>OB_HSMUSER[7:0]</displayName>
            <addressOffset>0x0</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>HSM USER</name>
                    <brief>HSM USER</brief>
                    <description>HSM USER</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>7</bitWidth>
                </field>
                <field>
                    <name>BSWAP</name>
                    <brief>BSWAP</brief>
                    <description>BSWAP</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMUSER_N[7:0]</name>
            <displayName>OB_HSMUSER_N[7:0]</displayName>
            <addressOffset>0x1</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_HSMUSER_N[7:0]</name>
                    <brief>OB_HSMUSER complement value bit 7 to 0</brief>
                    <description>OB_HSMUSER complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMSPC[7:0]</name>
            <displayName>OB_HSMSPC[7:0]</displayName>
            <addressOffset>0x2</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xA5</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_HSMSPC[7:0]</name>
                    <brief>HSM security protect code</brief>
                    <description>HSM security protect code</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMSPC_N[7:0]</name>
            <displayName>OB_HSMSPC_N[7:0]</displayName>
            <addressOffset>0x3</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x5A</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_HSMSPC_N[7:0]</name>
                    <brief>OB_HSMSPC complement value bit 7 to 0</brief>
                    <description>OB_HSMSPC complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMPFWP[7:0]</name>
            <displayName>OB_HSMPFWP[7:0]</displayName>
            <addressOffset>0x4</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_HSMPFWP[7]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 7(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[6]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 6(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[5]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 5(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[4]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 4(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[3]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 3(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[2]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 2(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[1]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 1(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMPFWP[0]</name>
                    <brief></brief>
                    <description>Page erase / program protection of HSM Pflash bit 0(0x00000001~0x00000000)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMPFWP_N[7:0]</name>
            <displayName>OB_HSMPFWP_N[7:0]</displayName>
            <addressOffset>0x5</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_HSMPFWP_N[7:0]</name>
                    <brief>OB_HSMPWP complement value bit 7 to 0</brief>
                    <description>OB_HSMPWP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMDFWP[7:0]</name>
            <displayName>OB_HSMDFWP[7:0]</displayName>
            <addressOffset>0x6</addressOffset>
            <size>0x8</size>
            <access>read-write</access>
            <reset>0xFF</reset>
            <complement>FFFF</complement>
            <fields>
                <field>
                    <name>OB_HSMDFWP[7]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 7(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>7</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[6]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 6(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>6</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[5]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 5(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>5</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[4]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 4(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>4</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[3]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 3(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>3</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[2]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 2(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>2</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[1]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 1(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>1</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
                <field>
                    <name>OB_HSMDFWP[0]</name>
                    <brief>**Address Area**</brief>
                    <description>Page erase / program protection of HSM Dflash bit 0(**Address Area**)@#x000A;0: protection active@#x000A;1: unprotected</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>1</bitWidth>
                </field>
            </fields>
        </OPByte>
        <OPByte>
            <name>OB_HSMDFWP_N[7:0]</name>
            <displayName>OB_HSMDFWP_N[7:0]</displayName>
            <addressOffset>0x7</addressOffset>
            <size>0x8</size>
            <access>read</access>
            <reset>0x00</reset>
            <complement>0</complement>
            <fields>
                <field>
                    <name>OB_HSMDFWP_N[7:0]</name>
                    <brief>OB_HSMDWP complement value bit 7 to 0</brief>
                    <description>OB_HSMDWP complement value bit 7 to 0</description>
                    <bitOffset>0</bitOffset>
                    <bitWidth>8</bitWidth>
                </field>
            </fields>
        </OPByte>
    </OPBytes>

